УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыКОтгрузке</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>ВРезерве</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КОформлению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КСборке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собирается</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Собрано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/ДоступныеОстаткиПланируемыхПоступлений/ДоступныеОстаткиПланируемыхПоступлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="daf8dd54-80ee-41d9-a8d1-409533bcac1a">
  <name>ДоступныеОстаткиПланируемыхПоступлений</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="f0877c5a-96ab-41aa-b1ec-aaedf8abeed8">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="8473b6d2-c972-4ac9-8e68-4a1614f32769">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7c3b211d-ef93-4cd9-838b-848fbbd49bb9">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="09190e01-0557-47ca-9397-2ba761cd1562">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7a919b8d-94eb-4b87-8751-d2561646f501">
    <name>ДатаДоступности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources>
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt.РасширениеСмарт/src/InformationRegisters/КалендарныеГрафики/КалендарныеГрафики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="17aadd5f-cda2-4785-a07f-3ab4b04434a6">
  <name>КалендарныеГрафики</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="71bc35e6-0fec-4e54-af2d-23d1357d1c3b">
    <name>ДеньВключенВГрафик</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="d5df31c3-89f9-469c-80a9-fb4706d30bc4">
    <name>ДатаГрафика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt.РасширениеСмарт/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Склады</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТекущаяДолжностьОтветственного</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаИспользованияСкладскихПомещений</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользованиеРабочихУчастков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСкладскиеПомещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УчетныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РозничныйВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекущийОтветственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПриходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыРасходныхОрдеров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаОрдернойСхемыПриОтраженииИзлишковНедостач</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаНачалаАдресногоХраненияОстатков</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИспользоватьСтатусыПересчетовТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтролироватьОперативныеОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НастройкаАдресногоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДляПоступленияГрузов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерииНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="39299529-e597-4f8e-a8bf-4eb5dc180cbb">
    <name>ВыборГруппы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ff476f7c-83dd-4bf3-b877-ee64c1fc2c1c">
    <name>ИспользоватьАдресноеХранение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6058b2d6-0f5a-4298-8e5c-da1204a63027">
    <name>смартПриоритетДляСпособаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/CommonModules/ОбеспечениеСервер/Module.bsl
#Область ПеренесеноСДоработками

&ИзменениеИКонтроль("ТаблицаЗаполнениеОбеспеченияУниверсальный")
Функция смарт_ТаблицаЗаполнениеОбеспеченияУниверсальный(ТаблицаВыделенныеСтроки,
                                                  ОформитьПоНакладным,
                                                  ТаблицаНевыделенныеСтроки,
                                                  Ссылка,
                                                  ГруппаСкладов,
                                                  ТаблицаДляПроведения,
                                                  ПараметрыЗаполнения) Экспорт
	
	ЗначенияПараметровЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление, ЗаполнятьЦелымиУпаковками", Новый Массив, Истина, Ложь);
	ЗаполнитьЗначенияСвойств(ЗначенияПараметровЗаполнения, ПараметрыЗаполнения);
	
	// Группировка потребностей по вариантам обеспечения (строки с одинаковой логикой обеспечения).
	Потребности = ТаблицыПотребностейПоВариантамОбеспечения();
	РазложитьПоВариантамОбеспечения(Потребности, ТаблицаВыделенныеСтроки, ЗначенияПараметровЗаполнения.ЗаполнятьЦелымиУпаковками);
	
	// Группировка невыделенных строк (строки-конкуренты для списания доступных остатков) по вариантам обеспечения.
	НевыделенныеСтроки = ТаблицыПотребностейПоВариантамОбеспечения();
	РазложитьПоВариантамОбеспечения(НевыделенныеСтроки, ТаблицаНевыделенныеСтроки);
	
	// Таблица Корректировок регистров обеспечения, для имитации проведения редактируемого документа.
	Корректировка = СтруктураКорректировкиОбеспечения();
	
	// Дополнительные сторно записи, если необходимы.
	Если ТаблицаДляПроведения <> Неопределено Тогда
		ДобавитьВКорректировку(Корректировка, ТаблицаДляПроведения);
	КонецЕсли;
	
	ДобавитьВКорректировку(Корректировка, НевыделенныеСтроки.Товары.Отгрузить);
	ДобавитьВКорректировку(Корректировка, НевыделенныеСтроки.Товары.Резервировать);
	ДобавитьВКорректировку(Корректировка, НевыделенныеСтроки.Товары.РезервироватьКСроку);
	ДобавитьВКорректировку(Корректировка, НевыделенныеСтроки.Товары.ОтгрузитьОбособленно);
	
	ДобавитьВКорректировку(Корректировка, НевыделенныеСтроки.Тара.Отгрузить);
	ДобавитьВКорректировку(Корректировка, НевыделенныеСтроки.Тара.Резервировать);
	ДобавитьВКорректировку(Корректировка, НевыделенныеСтроки.Тара.РезервироватьКСроку);
	ДобавитьВКорректировку(Корректировка, НевыделенныеСтроки.Тара.ОтгрузитьОбособленно);
	
	// Количество, которое считается отгруженным для обрабатываемых строк.
	ОтборТоварыКОтгрузке = ОтборТоварыКОтгрузке(ТаблицаВыделенныеСтроки);
	ОформитьПоОрдерам = РегистрыНакопления.ТоварыКОтгрузке.ТаблицаОформлено(ОтборТоварыКОтгрузке, Корректировка.ТоварыКОтгрузке);
	
	ТаблицыОформлено = ТаблицыОформлено(ТаблицаВыделенныеСтроки, ОформитьПоНакладным, ОформитьПоОрдерам);
	
	ДобавитьВКорректировку(Корректировка, ТаблицыОформлено.ПоНакладным);
	ДобавитьВКорректировкуУчестьПриИнвентаризации(
		Корректировка, НевыделенныеСтроки.Товары.ОтгрузитьОбособленно, ТаблицыОформлено.ПоНакладным);
	ДобавитьВКорректировку(Корректировка, ТаблицыОформлено.ПоОрдерам);
	
	// Сторно движений документа.
	СторноДвиженийДокумента(Корректировка, Новый Структура("Ссылка", Ссылка),);
	
	// Получение структуры доступных остатков и плановых поставок товаров и работ с учетом корректировок.
	Отбор = СтруктураОтбораОстатков();
	МассивСкладов = СкладыГруппы(ГруппаСкладов);
	ДобавитьАналитики(Отбор, ТаблицаВыделенныеСтроки, МассивСкладов);
	
	ВариантыОбеспечения = ВариантыОбеспечения(Отбор, Корректировка);
	ВариантыОбеспечения.Вставить("ОформитьПоНакладным", ОформитьПоНакладным);
	ВариантыОбеспечения.Вставить("ОформитьПоОрдерам", ТаблицыОформлено.ПоОрдерам);
	
	Если МассивСкладов <> Неопределено И МассивСкладов.Количество() <> 0 Тогда
		
		#Вставка
		//++#1221 смарт: Лопато 25.10.2022 //Изменить приоритет склада отгрузки  
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Ссылка, "СпособДоставки") Тогда
			СмартУточнитьПриоритетыСкладовПоСпособамДоставки(ВариантыОбеспечения.ПлановыеПоставки, Ссылка.СпособДоставки);
		КонецЕсли;
		//--#1221 смарт: Лопато 25.10.2022
		#КонецВставки
		Приоритеты = Новый Соответствие;
		ЗаполнитьПриоритетыВыбораСкладовВТаблице(ВариантыОбеспечения.ПлановыеПоставки, ВариантыОбеспечения.ВНаличииПодНазначение, Приоритеты);
		ЗаполнитьПриоритетыВыбораСкладовВТаблице(ВариантыОбеспечения.ПлановыеПоставки, ВариантыОбеспечения.ОжидаетсяПодНазначение, Приоритеты);
		ЗаполнитьПриоритетыВыбораСкладовВТаблице(ВариантыОбеспечения.ПлановыеПоставки, ВариантыОбеспечения.ВНаличии, Приоритеты);
		ЗаполнитьПриоритетыВыбораСкладовВТаблице(ВариантыОбеспечения.ПлановыеПоставки, ВариантыОбеспечения.Ожидается, Приоритеты);
		
	КонецЕсли;
	
	#Вставка
	//++ #Б1448 смарт: Шляпников 28.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль остатков по регистрам.
	смартЗапчастиГарантийные = ПараметрыЗаполнения.Свойство("смартЗапчастиГарантийные") И ПараметрыЗаполнения.смартЗапчастиГарантийные;
	
	Если ВариантыОбеспечения.Свойство("ВНаличии") Тогда
		смартСкорректироватьТаблицуОстатковПоПризнакуГарантийныхТоваров(ВариантыОбеспечения.ВНаличии, смартЗапчастиГарантийные);
	КонецЕсли;
	
	Если ВариантыОбеспечения.Свойство("ВНаличииПодНазначение") Тогда
		смартСкорректироватьТаблицуОстатковПоПризнакуГарантийныхТоваров(ВариантыОбеспечения.ВНаличииПодНазначение, смартЗапчастиГарантийные);
	КонецЕсли;
	
	Если ВариантыОбеспечения.Свойство("Ожидается") Тогда
		смартСкорректироватьТаблицуОстатковПоПризнакуГарантийныхТоваров(ВариантыОбеспечения.Ожидается, смартЗапчастиГарантийные);
	КонецЕсли;
	
	Если ВариантыОбеспечения.Свойство("ОжидаетсяПодНазначение") Тогда
		смартСкорректироватьТаблицуОстатковПоПризнакуГарантийныхТоваров(ВариантыОбеспечения.ОжидаетсяПодНазначение, смартЗапчастиГарантийные);
	КонецЕсли;
	
	Если ВариантыОбеспечения.Свойство("ОжидаетсяРаботы") Тогда
		смартСкорректироватьТаблицуОстатковПоПризнакуГарантийныхТоваров(ВариантыОбеспечения.ОжидаетсяРаботы, смартЗапчастиГарантийные);
	КонецЕсли;
	//-- #Б1448 смарт: Шляпников 28.11.2024
	#КонецВставки
	
	// Таблица с полями: Склад, ВариантОбеспечения, ДатаОтгрузки, Количество и Идентификатор (идентификатор строки таблицы формы).
	Результат = ТаблицаОбеспечения(Потребности, ВариантыОбеспечения, НевыделенныеСтроки, ЗначенияПараметровЗаполнения);
	
	Возврат Результат;
	
КонецФункции

&ИзменениеИКонтроль("СтруктураКорректировкиОбеспечения")
Функция смарт_СтруктураКорректировкиОбеспечения()
	
	#Удаление
	ТаблицаГрафикПоступленияТоваров = РегистрыНакопления.ГрафикПоступленияТоваров.СоздатьНаборЗаписей().ВыгрузитьКолонки(
	"Номенклатура, Характеристика, Склад, Назначение, ДатаСобытия, КоличествоИзЗаказов, КоличествоПодЗаказ");

	ТаблицаОбеспечениеЗаказов    = РегистрыНакопления.ОбеспечениеЗаказов.СоздатьНаборЗаписей().ВыгрузитьКолонки(
	"Номенклатура, Характеристика, Склад, Назначение, Период, Потребность, КЗаказу, НаличиеПодЗаказ");

	ТаблицаОбеспечениеЗаказовРаботами = РегистрыНакопления.ОбеспечениеЗаказовРаботами.СоздатьНаборЗаписей().ВыгрузитьКолонки(
	"Номенклатура, Характеристика, Подразделение, Назначение, Период, КОбеспечению");

	ТаблицаТоварыКОтгрузке = РегистрыНакопления.ТоварыКОтгрузке.СоздатьНаборЗаписей().ВыгрузитьКолонки(
	"Номенклатура, Характеристика, Склад, Назначение, Серия, ВРезерве, КОтгрузке");

	ТаблицаТоварыКПоступлению = РегистрыНакопления.ТоварыКПоступлению.СоздатьНаборЗаписей().ВыгрузитьКолонки(
	"Номенклатура, Характеристика, Склад, Назначение, КПоступлению");
	#КонецУдаления

	#Вставка
	//++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.
	ТаблицаГрафикПоступленияТоваров = РегистрыНакопления.ГрафикПоступленияТоваров.СоздатьНаборЗаписей().ВыгрузитьКолонки(
	"Номенклатура, Характеристика, Склад, Назначение, ДатаСобытия, КоличествоИзЗаказов, КоличествоПодЗаказ, смартКоличествоИзЗаказовГарантийные, смартКоличествоПодЗаказГарантийные");

	ТаблицаОбеспечениеЗаказов    = РегистрыНакопления.ОбеспечениеЗаказов.СоздатьНаборЗаписей().ВыгрузитьКолонки(
	"Номенклатура, Характеристика, Склад, Назначение, Период, Потребность, КЗаказу, НаличиеПодЗаказ, смартПотребностьГарантийные, смартКЗаказуГарантийные, смартНаличиеПодЗаказГарантийные");

	ТаблицаОбеспечениеЗаказовРаботами = РегистрыНакопления.ОбеспечениеЗаказовРаботами.СоздатьНаборЗаписей().ВыгрузитьКолонки(
	"Номенклатура, Характеристика, Подразделение, Назначение, Период, КОбеспечению");

	ТаблицаТоварыКОтгрузке = РегистрыНакопления.ТоварыКОтгрузке.СоздатьНаборЗаписей().ВыгрузитьКолонки(
	"Номенклатура, Характеристика, Склад, Назначение, Серия, ВРезерве, КОтгрузке, смартВРезервеГарантийные, смартКОтгрузкеГарантийные");

	ТаблицаТоварыКПоступлению = РегистрыНакопления.ТоварыКПоступлению.СоздатьНаборЗаписей().ВыгрузитьКолонки(
	"Номенклатура, Характеристика, Склад, Назначение, КПоступлению");
	//-- #Б1376 смарт: Шляпников 19.11.2024
	#КонецВставки
	
	Корректировка = Новый Структура();
	Корректировка.Вставить("ГрафикПоступленияТоваров",   ТаблицаГрафикПоступленияТоваров);
	Корректировка.Вставить("ОбеспечениеЗаказов",         ТаблицаОбеспечениеЗаказов);
	Корректировка.Вставить("ОбеспечениеЗаказовРаботами", ТаблицаОбеспечениеЗаказовРаботами);
	Корректировка.Вставить("ТоварыКОтгрузке",            ТаблицаТоварыКОтгрузке);
	Корректировка.Вставить("ТоварыКПоступлению",         ТаблицаТоварыКПоступлению);

	Возврат Корректировка;

КонецФункции

&ИзменениеИКонтроль("ПараметрыВыбораОбеспечения")
Функция смарт_ПараметрыВыбораОбеспечения(ТекущаяСтрока, Объект, ТабЧасть, ПутиКДанным, Параметры)

	Перем СтатусКВыполнению, ГруппаСкладов, МенеджерРегистра, ТаблицаДляПроведения, ОтборПоИзмерениям;
	ПрименитьПараметрыДокумента(Параметры, СтатусКВыполнению, ГруппаСкладов, МенеджерРегистра, ТаблицаДляПроведения, ОтборПоИзмерениям);

	ИдентификаторыСтрок = Новый Массив();
	ИдентификаторыСтрок.Добавить(ТекущаяСтрока);

	// Таблица выделенных строк табличной части.
	Таблица = ВыделенныеСтрокиВТаблицу(ТабЧасть, ИдентификаторыСтрок, Объект, ПутиКДанным);
	ВыделеннаяСтрока = Таблица[0];

	Строка = ТабЧасть.НайтиПоИдентификатору(ВыделеннаяСтрока.Идентификатор);
	Строка.Количество = 0;

	// Таблица невыделенных строк табличной части с такой же аналитикой как у текущей строки.
	Если ЗначениеЗаполнено(ГруппаСкладов) Тогда
		Отбор = Новый Структура("Номенклатура, Характеристика, Подразделение");
	Иначе
		Отбор = Новый Структура("Номенклатура, Характеристика, Подразделение, Склад");
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Отбор, ВыделеннаяСтрока);

	ТаблицаНевыделенныеСтроки = СтрокиВТаблицу(ТабЧасть, Объект, ПутиКДанным, Отбор);

	// Для документов, где возможны разные назначения в табличной части (например ЗаказПереработчику),
	// удалим строки с другими назначениями для корректного расчета "Отгрузить".
	Индекс = ТаблицаНевыделенныеСтроки.Количество() - 1;
	Пока Индекс > -1 Цикл
		Если ТаблицаНевыделенныеСтроки[Индекс].Назначение <> ВыделеннаяСтрока.Назначение
			И (ТаблицаНевыделенныеСтроки[Индекс].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно
			Или ТаблицаНевыделенныеСтроки[Индекс].ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно) Тогда
			ТаблицаНевыделенныеСтроки.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;

	// Дополнительные сторно записи, если необходимы.
	Если ТаблицаДляПроведения <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаДляПроведения, ТаблицаНевыделенныеСтроки);
	КонецЕсли;

	Строка = ТабЧасть.НайтиПоИдентификатору(ВыделеннаяСтрока.Идентификатор);
	Строка.Количество = ВыделеннаяСтрока.Количество;

	ОтборОформлено = ТаблицаПоОписаниюПолей(Новый Структура("Ссылка, КодСтроки",
	ОбеспечениеКлиентСервер.ОписаниеТиповЗаказыКОбеспечению(), ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(15, 0)));
	ЗаполнитьЗначенияСвойств(ОтборОформлено.Добавить(), ВыделеннаяСтрока);

	ОформитьПоНакладным = МенеджерРегистра.ТаблицаОформлено(ОтборОформлено, ОтборПоИзмерениям, Истина);

	Результат = ПараметрыВыбораОбеспеченияУниверсальный(Таблица, ОформитьПоНакладным, ТаблицаНевыделенныеСтроки, Объект.Ссылка);
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Результат.Вставить("ГруппаСкладов", ГруппаСкладов);
		Результат.Вставить("СписокВыбора", Неопределено);
		Результат.Вставить("ТаблицаНевыделенныеСтроки", ТаблицаНевыделенныеСтроки);
		
		#Вставка
		//++ #Б1448 смарт: Шляпников 28.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль остатков по регистрам.
		Если ОбщегоНазначения.ЕстьРеквизитОбъекта("смартЗапчастиГарантийные", Объект.Ссылка.Метаданные()) Тогда
			Результат.Вставить("смартЗапчастиГарантийные", Объект.смартЗапчастиГарантийные);
		КонецЕсли;
		//-- #Б1448 смарт: Шляпников 28.11.2024
		//++ #Б2972 смарт: Шляпников 07.11.2025 / Раздельный учет товаров. Гарантийные запчасти. Заказ на сборку.
		Попытка
			смартЗапчастиГарантийные = Строка.смартЗапчастиГарантийные;
			Результат.Вставить("смартЗапчастиГарантийные", смартЗапчастиГарантийные);
		Исключение
		КонецПопытки;
		//-- #Б2972 смарт: Шляпников 07.11.2025
		#КонецВставки
		
	КонецЕсли;
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ДоработкиСмарт

//++ #Б1448 смарт: Шляпников 28.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль остатков по регистрам.
Процедура смартСкорректироватьТаблицуОстатковПоПризнакуГарантийныхТоваров(ТаблицаОстатков, смартЗапчастиГарантийные) Экспорт
	
	Если смартЗапчастиГарантийные Тогда
		
		Количество = ТаблицаОстатков.Количество();
		Для н = 1 По Количество Цикл
			
			стрТаблицаОстатков = ТаблицаОстатков[Количество - н];
			Если стрТаблицаОстатков.смартКоличествоГарантийные = 0 Тогда
				ТаблицаОстатков.Удалить(стрТаблицаОстатков);
			Иначе
				стрТаблицаОстатков.Количество = стрТаблицаОстатков.смартКоличествоГарантийные;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Количество = ТаблицаОстатков.Количество();
		Для н = 1 По Количество Цикл
			
			стрТаблицаОстатков = ТаблицаОстатков[Количество - н];
			Если стрТаблицаОстатков.Количество = 0 Тогда
				ТаблицаОстатков.Удалить(стрТаблицаОстатков);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура смартУточнитьПриоритетыСкладовПоСпособамДоставки(ПлановыеПоставки, СпособДоставки)
//++#1221 смарт: Лопато 25.10.2022 //Изменить приоритет склада отгрузки  

    МассивСкладов = ПлановыеПоставки.ВыгрузитьКолонку("Склад");

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.смартПриоритетДляСпособаДоставки = &смартПриоритетДляСпособаДоставки
	|	И Склады.Ссылка В(&МассивСкладов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склады.Наименование
	|";
	Запрос.Параметры.Вставить("МассивСкладов", МассивСкладов);
	Запрос.Параметры.Вставить("смартПриоритетДляСпособаДоставки", СпособДоставки);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ПлановыеПоставки.ЗаполнитьЗначения(9999, "ПриоритетТипаОбеспечения");
		
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		
		СчПриоритет = 1;
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			ОтборСклад = Новый Структура("Склад", ВыборкаЗапроса.Склад);
			СтрокиСкладПлановыеПоставки = ПлановыеПоставки.НайтиСтроки(ОтборСклад);
			
			Для Каждого СтрПлановыеПоставки Из СтрокиСкладПлановыеПоставки Цикл
				СтрПлановыеПоставки.ПриоритетТипаОбеспечения = СчПриоритет;				   		
			КонецЦикла;	
			
			СчПриоритет = СчПриоритет + 1;
			
		КонецЦикла;

	КонецЕсли;
		
//--#1221 смарт: Лопато 25.10.2022
КонецПроцедуры

&ИзменениеИКонтроль("ТекстЗапросаДоступныхОстатковПоДатамДляПодбора")
Функция смарт_ТекстЗапросаДоступныхОстатковПоДатамДляПодбора(ЕстьХарактеристика, ХарактеристикиИспользуются, СоставРазделовЗапроса)

	Если СоставРазделовЗапроса = Неопределено Тогда
		СоставРазделовЗапроса = Новый Массив();
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Набор.Склад                             КАК Склад,
	|	Набор.Номенклатура                      КАК Номенклатура,
	|	Набор.Характеристика                    КАК Характеристика,
	|	СУММА(Набор.ВНаличии)                   КАК ВНаличии,
	|	СУММА(Набор.ВНаличии)                   КАК ВНаличииВБазовыхЕдиницах,
	|	СУММА(Набор.ВРезервеСоСклада)           КАК ВРезервеСоСклада,
	|	СУММА(Набор.ВРезервеПодЗаказ)           КАК ВРезервеПодЗаказ
	|
	|ПОМЕСТИТЬ ВтСвободныеОстатки
	|ИЗ(
	|	ВЫБРАТЬ
	|		Т.Склад                             КАК Склад,
	|		Т.Номенклатура                      КАК Номенклатура,
	|		Т.Характеристика                    КАК Характеристика,
	|		Т.ВНаличииОстаток                   КАК ВНаличии,
	|		Т.ВРезервеСоСкладаОстаток           КАК ВРезервеСоСклада,
	|		Т.ВРезервеПодЗаказОстаток           КАК ВРезервеПодЗаказ
	|	ИЗ
	|		РегистрНакопления.СвободныеОстатки.Остатки(,
	|			Склад В (&Склады) И Номенклатура = &Номенклатура) КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.Склад                             КАК Склад,
	|		Т.Номенклатура                      КАК Номенклатура,
	|		Т.Характеристика                    КАК Характеристика,
	|		0                                   КАК ВНаличии,
	|		0                                   КАК ВРезервеСоСклада,
	|		0                                   КАК ВРезервеПодЗаказ
	|
	|	ИЗ
	|		РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	|	ГДЕ
	|		Т.Склад В (&Склады) И Т.Номенклатура = &Номенклатура) КАК Набор
	|СГРУППИРОВАТЬ ПО
	|	Набор.Склад, Набор.Номенклатура, Набор.Характеристика
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад
	|;
	|
	|/////////////////////////////////////////////////////////////
	|";

	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	Т.Склад               КАК Склад,
	|	Т.СкладНаименование   КАК СкладНаименование,
	|	СУММА(Т.ВНаличии)     КАК ВНаличии,
	|	СУММА(Т.ВНаличииВБазовыхЕдиницах) КАК ВНаличииВБазовыхЕдиницах,
	|	СУММА(Свободно)       КАК Свободно
	|ИЗ(
	|	ВЫБРАТЬ
	|		Т.Склад               КАК Склад,
	|		Т.Склад.Наименование  КАК СкладНаименование,
	|		Т.ВНаличии            КАК ВНаличии,
	|		Т.ВНаличииВБазовыхЕдиницах КАК ВНаличииВБазовыхЕдиницах,
	|		Т.ВНаличии
	|			- Т.ВРезервеСоСклада
	|			- Т.ВРезервеПодЗаказ КАК Свободно
	|	ИЗ
	|		ВтСвободныеОстатки КАК Т
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.Склад               КАК Склад,
	|		Т.Склад.Наименование  КАК СкладНаименование,
	|		0                     КАК ВНаличии,
	|		0                     КАК ВНаличииВБазовыхЕдиницах,
	|		Т.Количество          КАК Свободно
	|	ИЗ
	|		РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
	|	ГДЕ
	|		Т.ДатаДоступности = ДАТАВРЕМЯ(1, 1, 1)
	|		И Т.Количество < 0
	|		И Т.Склад В (&Склады)
	|		И Т.Номенклатура = &Номенклатура) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.Склад, Т.СкладНаименование
	|УПОРЯДОЧИТЬ ПО
	|	СкладНаименование
	|;
	|
	|/////////////////////////////////////////////////////////////
	|";

	СоставРазделовЗапроса.Добавить("ВтСвободныеОстатки");
	СоставРазделовЗапроса.Добавить("ДоступныеТовары");

	Если Не ЕстьХарактеристика И ХарактеристикиИспользуются Тогда

		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	Т.Склад                                  КАК Склад,
		|	Т.Характеристика                         КАК Характеристика,
		|	Т.ДатаДоступности                        КАК Дата,
		|	МАКСИМУМ(Т.Количество)
		|		- МАКСИМУМ(ЕСТЬNULL(ПредыдущиеДни.Количество, 0))    КАК Количество
		|ПОМЕСТИТЬ ВтПриростДоступностиПоХарактеристике
		|ИЗ
		|	РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК ПредыдущиеДни
		|		ПО Т.Склад          = ПредыдущиеДни.Склад
		|		 И Т.Номенклатура    = ПредыдущиеДни.Номенклатура
		|		 И Т.Характеристика  = ПредыдущиеДни.Характеристика
		|		 И Т.ДатаДоступности > ПредыдущиеДни.ДатаДоступности
		|ГДЕ
		|	Т.Склад В (&Склады) И Т.Номенклатура = &Номенклатура
		|СГРУППИРОВАТЬ ПО
		|	Т.Склад, Т.Характеристика,
		|	Т.ДатаДоступности
		|ИНДЕКСИРОВАТЬ ПО
		|	Дата
		|;
		|
		|/////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т.Склад                         КАК Склад,
		|	Т.Дата                          КАК Период,
		|	СУММА(ЕСТЬNULL(ПредыдущиеДни.Количество, 0))
		|		+ МАКСИМУМ(ЕСТЬNULL(
		|			ОстаткиСклада.ВНаличии
		|				- ОстаткиСклада.ВРезервеСоСклада
		|				- ОстаткиСклада.ВРезервеПодЗаказ, 0)) КАК Доступно
		|ИЗ
		|	ВтПриростДоступностиПоХарактеристике КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПриростДоступностиПоХарактеристике КАК ПредыдущиеДни
		|		ПО Т.Склад = ПредыдущиеДни.Склад
		#Удаление //++ #Б-1022 смарт: Фролов 18.11.2024 //Остатки и доступность товаров с характеристиками
		|		 И Т.Дата >= ПредыдущиеДни.Дата
		#КонецУдаления
		#Вставка
		//++ #Б-1022 смарт: Фролов 18.11.2024 //Остатки и доступность товаров с характеристиками
		|		 И Т.Дата = ПредыдущиеДни.Дата
		|		 И Т.Характеристика = ПредыдущиеДни.Характеристика
		//-- #Б-1022 смарт: Фролов 18.11.2024
		#КонецВставки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСвободныеОстатки КАК ОстаткиСклада
		|		ПО Т.Склад          = ОстаткиСклада.Склад
		|		 И Т.Характеристика = ОстаткиСклада.Характеристика
		|ГДЕ
		|	Т.Дата > ДАТАВРЕМЯ(1, 1, 1)
		|СГРУППИРОВАТЬ ПО
		|	Т.Склад, Т.Склад.Наименование, Т.Дата
		|УПОРЯДОЧИТЬ ПО
		|	Т.Склад.Наименование, Период";

		СоставРазделовЗапроса.Добавить("ВтПриростДоступностиПоХарактеристике");

	Иначе

		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	Т.Склад                         КАК Склад,
		|	Т.ДатаДоступности               КАК Период,
		|	Т.Количество
		|		+ ЕСТЬNULL(ОстаткиСклада.ВНаличии
		|				- ОстаткиСклада.ВРезервеСоСклада
		|				- ОстаткиСклада.ВРезервеПодЗаказ, 0) КАК Доступно
		|ИЗ
		|	РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВтСвободныеОстатки КАК ОстаткиСклада
		|		ПО Т.Склад          = ОстаткиСклада.Склад
		|		 И Т.Характеристика = ОстаткиСклада.Характеристика
		|ГДЕ
		|	Т.Склад В (&Склады) И Т.Номенклатура = &Номенклатура
		|	И Т.ДатаДоступности > ДАТАВРЕМЯ(1, 1, 1)
		|УПОРЯДОЧИТЬ ПО
		|	Т.Склад.Наименование, Период";

	КонецЕсли;

	СоставРазделовЗапроса.Добавить("ПланируемыеОстатки");

	#Вставка
	//++ #Б-1022 смарт: Мосолов 30.10.2024 //Остатки и доступность товаров с характеристиками

	Если Не ЕстьХарактеристика И ХарактеристикиИспользуются Тогда

		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|/////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ТаблицаНаДаты.Склад                         КАК Склад,
		|	ТаблицаНаДаты.Дата                          КАК Период,
		|	СУММА(ТаблицаНаДаты.Количество) КАК ДоступноНаДату
		|ИЗ
		|	ВтПриростДоступностиПоХарактеристике КАК ТаблицаНаДаты
		|ГДЕ
		|	ТаблицаНаДаты.Дата > ДАТАВРЕМЯ(1, 1, 1)
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНаДаты.Склад, ТаблицаНаДаты.Склад.Наименование, ТаблицаНаДаты.Дата
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаНаДаты.Склад.Наименование, Период";

	Иначе

		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|/////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ТаблицаНаДаты.Склад                         КАК Склад,
		|	ТаблицаНаДаты.ДатаДоступности               КАК Период,
		|	МАКСИМУМ(ТаблицаНаДаты.Количество)
		|		- МАКСИМУМ(ЕСТЬNULL(ПредыдущиеДни.Количество, 0)) КАК ДоступноНаДату
		|ИЗ
		|	РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК ТаблицаНаДаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений КАК ПредыдущиеДни
		|		ПО ТаблицаНаДаты.Склад          = ПредыдущиеДни.Склад
		|		 И ТаблицаНаДаты.Номенклатура    = ПредыдущиеДни.Номенклатура
		|		 И ТаблицаНаДаты.ДатаДоступности > ПредыдущиеДни.ДатаДоступности
		|ГДЕ
		|	ТаблицаНаДаты.Склад В (&Склады) И ТаблицаНаДаты.Номенклатура = &Номенклатура
		|	И ТаблицаНаДаты.ДатаДоступности > ДАТАВРЕМЯ(1, 1, 1)
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНаДаты.Склад, ТаблицаНаДаты.ДатаДоступности
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаНаДаты.Склад.Наименование, Период";

	КонецЕсли;

	СоставРазделовЗапроса.Добавить("ПланируемыеОстаткиНаДату");

	//-- #Б-1022 смарт: Мосолов 30.10.2024 
	#КонецВставки
	
	Если ЕстьХарактеристика Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Номенклатура = &Номенклатура",
		"И Номенклатура = &Номенклатура И Характеристика = &Характеристика");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Т.Номенклатура = &Номенклатура",
		"И Т.Номенклатура = &Номенклатура И Т.Характеристика = &Характеристика");
	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

&ИзменениеИКонтроль("ТаблицаЗаполнениеОбеспечения")
Функция смарт_ТаблицаЗаполнениеОбеспечения(ИдентификаторыСтрок, Объект, ТабЧасть, ПараметрыЗаполнения, ПараметрыДокумента)

	Перем СтатусКВыполнению, ГруппаСкладов, МенеджерРегистра, ТаблицаДляПроведения, ДробитьУпаковки, ОтборПоИзмерениям;
	ПрименитьПараметрыДокумента(ПараметрыДокумента, СтатусКВыполнению, ГруппаСкладов, МенеджерРегистра, ТаблицаДляПроведения, ОтборПоИзмерениям);

	// Таблица выделенных строк табличной части.
	ТаблицаВыделенныеСтроки = ВыделенныеСтрокиВТаблицу(ТабЧасть, ИдентификаторыСтрок, Объект, ПараметрыДокумента.ПутиКДанным);

	ОтборОформлено = ТаблицаПоОписаниюПолей(
	Новый Структура(
	"Ссылка, КодСтроки",
	ОбеспечениеКлиентСервер.ОписаниеТиповЗаказыКОбеспечению(), ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(15, 0)));

	Для Каждого ВыделеннаяСтрока Из ТаблицаВыделенныеСтроки Цикл
		Строка = ТабЧасть.НайтиПоИдентификатору(ВыделеннаяСтрока.Идентификатор);
		Строка.Количество = 0;
		ЗаполнитьЗначенияСвойств(ОтборОформлено.Добавить(), ВыделеннаяСтрока);
	КонецЦикла;

	ОформитьПоНакладным = МенеджерРегистра.ТаблицаОформлено(ОтборОформлено, ОтборПоИзмерениям, Истина);

	// Таблица невыделенных строк табличной части.
	ТаблицаНевыделенныеСтроки = СтрокиВТаблицу(ТабЧасть, Объект, ПараметрыДокумента.ПутиКДанным);

	Для Каждого ВыделеннаяСтрока Из ТаблицаВыделенныеСтроки Цикл
		Строка = ТабЧасть.НайтиПоИдентификатору(ВыделеннаяСтрока.Идентификатор);
		Строка.Количество = ВыделеннаяСтрока.Количество;
	КонецЦикла;

	#Вставка
	//++ #Б1448 смарт: Шляпников 28.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Контроль остатков по регистрам.
	Если Объект.Свойство("смартЗапчастиГарантийные") И Объект.смартЗапчастиГарантийные Тогда
		ПараметрыЗаполнения.Вставить("смартЗапчастиГарантийные", Истина);
	Иначе
		ПараметрыЗаполнения.Вставить("смартЗапчастиГарантийные", Ложь);
	КонецЕсли;
	//-- #Б1448 смарт: Шляпников 28.11.2024
	#КонецВставки
	
	Результат = ТаблицаЗаполнениеОбеспеченияУниверсальный(
	ТаблицаВыделенныеСтроки,
	ОформитьПоНакладным,
	ТаблицаНевыделенныеСтроки,
	Объект.Ссылка,
	ГруппаСкладов,
	ТаблицаДляПроведения,
	ПараметрыЗаполнения);

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область РасчетСтатистикиПотребления

//++ #4314 смарт: Тимофеева 10.09.2025 / Автовзаказ. Доработка ядра расчета 

Процедура смартДобавитьВременнуюТаблицуСтатистикиПотребления(Запрос, ИмяТаблицыТовары) Экспорт

	СтатистикаПотребленияЯдроСмарт(Запрос, ИмяТаблицыТовары);
	
КонецПроцедуры

Процедура СтатистикаПотребленияЯдроСмарт(Запрос, ИмяТаблицыТовары)
	
	ЗапросПоПериодам = Новый Запрос;
	ЗапросПоПериодам.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросПоПериодам.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтТовары.смартПериодРасчетаАнализаПродаж КАК смартПериодРасчетаАнализаПродаж,
	|	ВтТовары.смартКоличествоПериодовРасчетаАнализаПродаж КАК смартКоличествоПериодовРасчетаАнализаПродаж
	|ИЗ
	|	ТоварыПереопределяемый КАК ВтТовары";	
	
	ЗапросПоПериодам.Текст = СтрЗаменить(ЗапросПоПериодам.Текст, "ТоварыПереопределяемый", ИмяТаблицыТовары);
		
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаПериодов = ЗапросПоПериодам.Выполнить().Выгрузить();	
	
	Для Каждого СтрокаТаблицыПериодов Из ТаблицаПериодов Цикл
		
		ПараметрыЗапроса = Новый Структура("смартПериодРасчетаАнализаПродаж, смартКоличествоПериодовРасчетаАнализаПродаж");	
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, СтрокаТаблицыПериодов);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыПериодов.смартПериодРасчетаАнализаПродаж) 
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицыПериодов.смартКоличествоПериодовРасчетаАнализаПродаж) Тогда
			
			ПараметрыЗапроса.Вставить("ПериодКлассификацииДатаНачала", Запрос.Параметры.ПериодКлассификацииДатаНачала);
			ПараметрыЗапроса.Вставить("ПериодКлассификацииДатаОкончания", Запрос.Параметры.ПериодКлассификацииДатаОкончания);

		Иначе
			ПериодАнализа = ОбщегоНазначенияУТКлиентСервер.РасширенныйПериод(
				ТекущаяДатаСеанса(), СтрокаТаблицыПериодов.смартПериодРасчетаАнализаПродаж, - СтрокаТаблицыПериодов.смартКоличествоПериодовРасчетаАнализаПродаж);
            ПараметрыЗапроса.Вставить("ПериодКлассификацииДатаНачала", ПериодАнализа.ДатаНачала);
			ПараметрыЗапроса.Вставить("ПериодКлассификацииДатаОкончания", ПериодАнализа.ДатаОкончания);
		КонецЕсли;		
		
		РассчитатьСтатистикуПотребленияТоваровПродажиПоВсемСкладам(Запрос.МенеджерВременныхТаблиц, ИмяТаблицыТовары, ПараметрыЗапроса)
		
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура РассчитатьСтатистикуПотребленияТоваровПродажиПоВсемСкладам(МенеджерВременныхТаблиц, ИмяТаблицыТовары, ПараметрыЗапроса)    
		
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("смартПериодРасчетаАнализаПродаж", ПараметрыЗапроса.смартПериодРасчетаАнализаПродаж);
	Запрос.УстановитьПараметр("смартКоличествоПериодовРасчетаАнализаПродаж", ПараметрыЗапроса.смартКоличествоПериодовРасчетаАнализаПродаж);
	Запрос.УстановитьПараметр("ПериодКлассификацииДатаНачала", ПараметрыЗапроса.ПериодКлассификацииДатаНачала);
	Запрос.УстановитьПараметр("ПериодКлассификацииДатаОкончания", ПараметрыЗапроса.ПериодКлассификацииДатаОкончания);
	//++ #5196 смарт: Тимофеева 16.12.2025 / Автозаказ. Дополнительные требования.
	Запрос.УстановитьПараметр("СписокСкладов", Справочники.смартПредопределенныеЗначения.Настройки.ОбеспечиваемыеСклады.ВыгрузитьКолонку("Склад"));
	//-- #5196 смарт: Тимофеева
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтТовары.Номенклатура КАК Номенклатура,
	|	ВтТовары.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	ТоварыПереопределяемый КАК ВтТовары
	|ГДЕ
	|	ВтТовары.смартПериодРасчетаАнализаПродаж = &смартПериодРасчетаАнализаПродаж
	|	И ВтТовары.смартКоличествоПериодовРасчетаАнализаПродаж = &смартКоличествоПериодовРасчетаАнализаПродаж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ПОМЕСТИТЬ КонтрагентыДляИсключенияПродаж
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО Контрагенты.ИНН = Организации.ИНН
	|ГДЕ
	|	НЕ Контрагенты.ИНН = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Продажи.Период КАК Дата,
	|	Продажи.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(Продажи.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ ПродажиПоДнямДанныеИБ
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	|			&ПериодКлассификацииДатаНачала,
	|			&ПериодКлассификацииДатаОкончания,
	|			ДЕНЬ,
	|			АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	|				И НЕ АналитикаУчетаПоПартнерам.Контрагент В
	|						(ВЫБРАТЬ
	|							ВТ.Контрагент КАК Контрагент
	|						ИЗ
	|							КонтрагентыДляИсключенияПродаж КАК ВТ)
	|				И АналитикаУчетаНоменклатуры.Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_Товары КАК Товары)) КАК Продажи
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Период,
	|	Продажи.АналитикаУчетаНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладах.Период, ДЕНЬ) КАК Дата,
	|	ТоварыНаСкладах.ВНаличииРасход > 0 КАК ЕстьРасход,
	|	ТоварыНаСкладах.ВНаличииКонечныйОстаток > 0 КАК ЕстьКонечныйОстаток,
	|	ТоварыНаСкладах.ВНаличииНачальныйОстаток > 0
	|		И ТоварыНаСкладах.ВНаличииКонечныйОстаток > 0 КАК ЕстьОстатки
	|ПОМЕСТИТЬ ПризнакиНаличияОстатковПоДатамДвижений
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	|			&ПериодКлассификацииДатаНачала,
	|			&ПериодКлассификацииДатаОкончания,
	|			ДЕНЬ,
	|			ДвиженияИГраницыПериода,
	//++ #5196 смарт: Тимофеева 16.12.2025 / Автозаказ. Дополнительные требования.
	|			Склад В (&СписокСкладов) И
	//-- #5196 смарт: Тимофеева 16.12.2025
	|				Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ВТ_Товары КАК Товары)) КАК ТоварыНаСкладах
	|ГДЕ
	|	ТоварыНаСкладах.Период < &ПериодКлассификацииДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПродажиПоДнямДанныеИБ.Номенклатура КАК Номенклатура,
	|	ПродажиПоДнямДанныеИБ.Дата КАК Дата,
	|	ТоварыНаСкладах.ВНаличииКонечныйОстаток > 0 КАК ЕстьКонечныйОстаток,
	|	ТоварыНаСкладах.ВНаличииНачальныйОстаток > 0
	|		И ТоварыНаСкладах.ВНаличииКонечныйОстаток > 0 КАК ЕстьОстатки
	|ПОМЕСТИТЬ ПризнакиНаличияОстатковПоДатамПродаж
	|ИЗ
	|	ПродажиПоДнямДанныеИБ КАК ПродажиПоДнямДанныеИБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(НАЧАЛОПЕРИОДА(ТоварыНаСкладах.Период, ДЕНЬ)) КАК ДатаБлижайшегоОстатка,
	|			ПродажиПоДнямДанныеИБ.Дата КАК Дата,
	|			ПродажиПоДнямДанныеИБ.Номенклатура КАК Номенклатура
	|		ИЗ
	|			ПродажиПоДнямДанныеИБ КАК ПродажиПоДнямДанныеИБ
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	|						&ПериодКлассификацииДатаНачала,
	|						&ПериодКлассификацииДатаОкончания,
	|						ДЕНЬ,
	|						ДвиженияИГраницыПериода,
	//++ #5196 смарт: Тимофеева 16.12.2025 / Автозаказ. Дополнительные требования.
	|						Склад В (&СписокСкладов) И
	//-- #5196 смарт: Тимофеева 16.12.2025
	|						Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|							И Номенклатура В
	|								(ВЫБРАТЬ
	|									Товары.Номенклатура КАК Номенклатура
	|								ИЗ
	|									ВТ_Товары КАК Товары)) КАК ТоварыНаСкладах
	|				ПО (ПродажиПоДнямДанныеИБ.Дата >= НАЧАЛОПЕРИОДА(ТоварыНаСкладах.Период, ДЕНЬ))
	|					И ПродажиПоДнямДанныеИБ.Номенклатура = ТоварыНаСкладах.Номенклатура
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПродажиПоДнямДанныеИБ.Номенклатура,
	|			ПродажиПоДнямДанныеИБ.Дата) КАК ВложенныйЗапрос
	|		ПО ПродажиПоДнямДанныеИБ.Дата = ВложенныйЗапрос.Дата
	|			И ПродажиПоДнямДанныеИБ.Номенклатура = ВложенныйЗапрос.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	|				&ПериодКлассификацииДатаНачала,
	|				&ПериодКлассификацииДатаОкончания,
	|				ДЕНЬ,
	|				ДвиженияИГраницыПериода,
	//++ #5196 смарт: Тимофеева 16.12.2025 / Автозаказ. Дополнительные требования.
	|				Склад В (&СписокСкладов) И
	//-- #5196 смарт: Тимофеева 16.12.2025
	|					Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура КАК Номенклатура
	|						ИЗ
	|							ВТ_Товары КАК Товары)) КАК ТоварыНаСкладах
	|		ПО (ВложенныйЗапрос.ДатаБлижайшегоОстатка = НАЧАЛОПЕРИОДА(ТоварыНаСкладах.Период, ДЕНЬ))
	|			И ПродажиПоДнямДанныеИБ.Номенклатура = ТоварыНаСкладах.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПризнакиНаличияОстатковПоДатамДвижений.Номенклатура КАК Номенклатура,
	|	ПризнакиНаличияОстатковПоДатамДвижений.Дата КАК Дата,
	|	ПризнакиНаличияОстатковПоДатамДвижений.ЕстьРасход КАК ЕстьРасход,
	|	ПризнакиНаличияОстатковПоДатамДвижений.ЕстьКонечныйОстаток КАК ЕстьКонечныйОстаток,
	|	ПризнакиНаличияОстатковПоДатамДвижений.ЕстьОстатки КАК ЕстьОстатки
	|ПОМЕСТИТЬ ПризнакиНаличияОстатковПоДатам
	|ИЗ
	|	ПризнакиНаличияОстатковПоДатамДвижений КАК ПризнакиНаличияОстатковПоДатамДвижений
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПризнакиНаличияОстатковПоДатамПродаж.Номенклатура,
	|	ПризнакиНаличияОстатковПоДатамПродаж.Дата,
	|	ЛОЖЬ,
	|	ПризнакиНаличияОстатковПоДатамПродаж.ЕстьКонечныйОстаток,
	|	ПризнакиНаличияОстатковПоДатамПродаж.ЕстьОстатки
	|ИЗ
	|	ПризнакиНаличияОстатковПоДатамПродаж КАК ПризнакиНаличияОстатковПоДатамПродаж
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПризнакиНаличияОстатковПоДатамДвижений КАК ПризнакиНаличияОстатковПоДатамДвижений
	|		ПО ПризнакиНаличияОстатковПоДатамПродаж.Номенклатура = ПризнакиНаличияОстатковПоДатамДвижений.Номенклатура
	|			И ПризнакиНаличияОстатковПоДатамПродаж.Дата = ПризнакиНаличияОстатковПоДатамДвижений.Дата
	|ГДЕ
	|	ПризнакиНаличияОстатковПоДатамДвижений.Дата ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Константы.ОсновнойКалендарьПредприятия КАК Календарь,
	|	График.ДатаГрафика КАК Дата
	|ПОМЕСТИТЬ ГрафикРаботыПоКалендарю
	|ИЗ
	|	Константы КАК Константы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КалендарныеГрафики КАК График
	|		ПО Константы.ОсновнойКалендарьПредприятия = График.Календарь
	|			И (График.ДеньВключенВГрафик)
	|			И (ГОД(&ПериодКлассификацииДатаНачала) <= График.Год)
	|			И (График.Год <= ГОД(&ПериодКлассификацииДатаОкончания))
	|			И (&ПериодКлассификацииДатаНачала <= График.ДатаГрафика)
	|			И (График.ДатаГрафика <= &ПериодКлассификацииДатаОкончания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПризнакиПоДатам.Номенклатура КАК Номенклатура,
	|	РабочиеДни.Дата КАК Дата,
	|	МАКСИМУМ(ПризнакиПоДатам.Дата) КАК ДатаПризнака,
	|	МАКСИМУМ(ПризнакиПоДатам.Дата = РабочиеДни.Дата) КАК ИспользуетсяПризнакРассчитанныйДляТекущегоДня
	|ПОМЕСТИТЬ ДатыПризнаковНаличияОстатковДляДня
	|ИЗ
	|	ПризнакиНаличияОстатковПоДатам КАК ПризнакиПоДатам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГрафикРаботыПоКалендарю КАК РабочиеДни
	|		ПО ПризнакиПоДатам.Дата <= РабочиеДни.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ПризнакиПоДатам.Номенклатура,
	|	РабочиеДни.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расход.Номенклатура КАК Номенклатура,
	|	Расход.Дата КАК Дата,
	|	Расход.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА ПризнакиНаличия.ЕстьОстатки
	|			ТОГДА Расход.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоВДниПолныхПродаж
	|ПОМЕСТИТЬ РасходПоДням
	|ИЗ
	|	ПродажиПоДнямДанныеИБ КАК Расход
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикРаботыПоКалендарю КАК РабочиеДни
	|		ПО Расход.Дата = РабочиеДни.Дата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПризнакиНаличияОстатковПоДатам КАК ПризнакиНаличия
	|		ПО (ПризнакиНаличия.Дата = Расход.Дата)
	|			И (ПризнакиНаличия.Номенклатура = Расход.Номенклатура)
	|ГДЕ
	|	НЕ РабочиеДни.Календарь ЕСТЬ NULL
	|	И НЕ ПризнакиНаличия.Номенклатура ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расход.Номенклатура КАК Номенклатура,
	|	СУММА(Расход.Количество) КАК Количество,
	|	СУММА(Расход.КоличествоВДниПолныхПродаж) КАК КоличествоВДниПолныхПродаж,
	|	СУММА(Расход.Количество * Расход.Количество) КАК КоличествоКвадрат,
	|	СУММА(Расход.КоличествоВДниПолныхПродаж * Расход.КоличествоВДниПолныхПродаж) КАК КоличествоВДниПолныхПродажКвадрат
	|ПОМЕСТИТЬ Расходы
	|ИЗ
	|	РасходПоДням КАК Расход
	|
	|СГРУППИРОВАТЬ ПО
	|	Расход.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыПризнаков.Номенклатура КАК Номенклатура,
	|	ДатыПризнаков.Дата КАК Дата,
	|	ДатыПризнаков.ИспользуетсяПризнакРассчитанныйДляТекущегоДня
	|			И ПризнакиПоДатам.ЕстьРасход
	|		ИЛИ ПризнакиПоДатам.ЕстьКонечныйОстаток КАК Учитывать,
	|	ДатыПризнаков.ИспользуетсяПризнакРассчитанныйДляТекущегоДня
	|			И ПризнакиПоДатам.ЕстьОстатки
	|		ИЛИ НЕ ДатыПризнаков.ИспользуетсяПризнакРассчитанныйДляТекущегоДня
	|			И ПризнакиПоДатам.ЕстьКонечныйОстаток КАК УчитыватьВДняхПолныхПродаж
	|ПОМЕСТИТЬ ПризнакиУчетаДней
	|ИЗ
	|	ДатыПризнаковНаличияОстатковДляДня КАК ДатыПризнаков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПризнакиНаличияОстатковПоДатам КАК ПризнакиПоДатам
	|		ПО (ПризнакиПоДатам.Дата = ДатыПризнаков.ДатаПризнака)
	|			И (ПризнакиПоДатам.Номенклатура = ДатыПризнаков.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасходПоДням КАК Расход
	|		ПО (Расход.Дата = ДатыПризнаков.Дата)
	|			И (Расход.Номенклатура = ДатыПризнаков.Номенклатура)
	|ГДЕ
	|	(ДатыПризнаков.ИспользуетсяПризнакРассчитанныйДляТекущегоДня
	|				И ПризнакиПоДатам.ЕстьРасход
	|			ИЛИ ПризнакиПоДатам.ЕстьКонечныйОстаток
	|			ИЛИ ДатыПризнаков.ИспользуетсяПризнакРассчитанныйДляТекущегоДня
	|				И ПризнакиПоДатам.ЕстьОстатки
	|			ИЛИ НЕ ДатыПризнаков.ИспользуетсяПризнакРассчитанныйДляТекущегоДня
	|				И ПризнакиПоДатам.ЕстьКонечныйОстаток)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Признаки.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА Признаки.Учитывать
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДней,
	|	СУММА(ВЫБОР
	|			КОГДА Признаки.УчитыватьВДняхПолныхПродаж
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДнейПолныхПродаж
	|ПОМЕСТИТЬ УчитываемыеДни
	|ИЗ
	|	ПризнакиУчетаДней КАК Признаки
	|ГДЕ
	|	(Признаки.Учитывать
	|			ИЛИ Признаки.УчитыватьВДняхПолныхПродаж)
	|
	|СГРУППИРОВАТЬ ПО
	|	Признаки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расход.Номенклатура КАК Номенклатура,
	|	Расход.Количество КАК Расход,
	|	ВЫБОР
	|		КОГДА УчитываемыеДни.КоличествоДнейПолныхПродаж = 0
	|				ИЛИ Расход.Количество / УчитываемыеДни.КоличествоДней > Расход.КоличествоВДниПолныхПродаж / УчитываемыеДни.КоличествоДнейПолныхПродаж
	|			ТОГДА Расход.Количество / УчитываемыеДни.КоличествоДней
	|		ИНАЧЕ Расход.КоличествоВДниПолныхПродаж / УчитываемыеДни.КоличествоДнейПолныхПродаж
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА УчитываемыеДни.КоличествоДнейПолныхПродаж = 0
	|				ИЛИ Расход.Количество / УчитываемыеДни.КоличествоДней > Расход.КоличествоВДниПолныхПродаж / УчитываемыеДни.КоличествоДнейПолныхПродаж
	|			ТОГДА Расход.КоличествоКвадрат / УчитываемыеДни.КоличествоДней
	|		ИНАЧЕ Расход.КоличествоВДниПолныхПродажКвадрат / УчитываемыеДни.КоличествоДнейПолныхПродаж
	|	КОНЕЦ КАК КоличествоКвадратДляДисперсии,
	|	ВЫБОР
	|		КОГДА УчитываемыеДни.КоличествоДнейПолныхПродаж = 0
	|				ИЛИ Расход.Количество / УчитываемыеДни.КоличествоДней > Расход.КоличествоВДниПолныхПродаж / УчитываемыеДни.КоличествоДнейПолныхПродаж
	|			ТОГДА Расход.Количество / УчитываемыеДни.КоличествоДней
	|		ИНАЧЕ Расход.КоличествоВДниПолныхПродаж / УчитываемыеДни.КоличествоДнейПолныхПродаж
	|	КОНЕЦ КАК КоличествоДляДисперсии,
	|	ВЫБОР
	|		КОГДА УчитываемыеДни.КоличествоДнейПолныхПродаж = 0
	|				ИЛИ Расход.Количество / УчитываемыеДни.КоличествоДней > Расход.КоличествоВДниПолныхПродаж / УчитываемыеДни.КоличествоДнейПолныхПродаж
	|			ТОГДА УчитываемыеДни.КоличествоДней
	|		ИНАЧЕ УчитываемыеДни.КоличествоДнейПолныхПродаж
	|	КОНЕЦ КАК КоличествоДнейДляДисперсии
	|ПОМЕСТИТЬ СреднедневноеПотребление
	|ИЗ
	|	Расходы КАК Расход
	|		ЛЕВОЕ СОЕДИНЕНИЕ УчитываемыеДни КАК УчитываемыеДни
	|		ПО (УчитываемыеДни.Номенклатура = Расход.Номенклатура)
	|ГДЕ
	|	НЕ УчитываемыеДни.Номенклатура ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Набор.Номенклатура КАК Номенклатура,
	|	Набор.КоличествоДнейДляДисперсии КАК КоличествоДнейДляДисперсии,
	|	СУММА(Набор.Расход) КАК Расход,
	|	СУММА(Набор.Количество) КАК Количество,
	|	СУММА(Набор.Дисперсия) КАК Дисперсия,
	|	ВЫБОР
	|		КОГДА СУММА(Набор.КоличествоДляДисперсии * Набор.КоличествоДляДисперсии) = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ СУММА(Набор.Дисперсия) / СУММА(Набор.КоличествоДляДисперсии * Набор.КоличествоДляДисперсии) < 0.0025
	|	КОНЕЦ КАК ПотреблениеСтабильно
	|ПОМЕСТИТЬ СреднедневноеПотреблениеТовара
	|ИЗ
	|	(ВЫБРАТЬ
	|		Потребление.Номенклатура КАК Номенклатура,
	|		Потребление.Расход КАК Расход,
	|		Потребление.КоличествоДнейДляДисперсии КАК КоличествоДнейДляДисперсии,
	|		Потребление.Количество КАК Количество,
	|		Потребление.КоличествоДляДисперсии КАК КоличествоДляДисперсии,
	|		ВЫБОР
	|			КОГДА Потребление.КоличествоДнейДляДисперсии = 1
	|				ТОГДА 0
	|			ИНАЧЕ Потребление.КоличествоДнейДляДисперсии / (Потребление.КоличествоДнейДляДисперсии - 1) * (Потребление.КоличествоКвадратДляДисперсии - Потребление.КоличествоДляДисперсии * Потребление.КоличествоДляДисперсии)
	|		КОНЕЦ КАК Дисперсия
	|	ИЗ
	|		СреднедневноеПотребление КАК Потребление) КАК Набор
	|
	|СГРУППИРОВАТЬ ПО
	|	Набор.Номенклатура,
	|	Набор.КоличествоДнейДляДисперсии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Товары.Склад КАК Склад,
	|	&ПериодКлассификацииДатаНачала КАК ДатаНачалаПериода,
	|	&ПериодКлассификацииДатаОкончания КАК ДатаОкончанияПериода,
	|	ЕСТЬNULL(СреднедневноеПотреблениеТовара.Расход, 0) КАК Потребление,
	|	ЕСТЬNULL(СреднедневноеПотреблениеТовара.Количество, 0) КАК СреднедневноеПотребление,
	|	ЕСТЬNULL(СреднедневноеПотреблениеТовара.Дисперсия, 0) КАК ДисперсияПотребления,
	|	ЕСТЬNULL(СреднедневноеПотреблениеТовара.ПотреблениеСтабильно, ЛОЖЬ) КАК ПотреблениеСтабильно
	|ДОБАВИТЬ ВтСтатистикаПотребления
	|ИЗ
	|	ВТ_Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ СреднедневноеПотреблениеТовара КАК СреднедневноеПотреблениеТовара
	|		ПО (СреднедневноеПотреблениеТовара.Номенклатура = Товары.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ КонтрагентыДляИсключенияПродаж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПродажиПоДнямДанныеИБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПризнакиНаличияОстатковПоДатамДвижений
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПризнакиНаличияОстатковПоДатамПродаж
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПризнакиНаличияОстатковПоДатам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ГрафикРаботыПоКалендарю
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДатыПризнаковНаличияОстатковДляДня
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасходПоДням
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Расходы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПризнакиУчетаДней
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ УчитываемыеДни
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СреднедневноеПотребление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СреднедневноеПотреблениеТовара";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТоварыПереопределяемый", ИмяТаблицыТовары);
	РезультатЗапроса = Запрос.Выполнить();
КонецПроцедуры  

&ИзменениеИКонтроль("ТаблицаЗаполнениеОбеспеченияДокумента")
Функция смарт_ТаблицаЗаполнениеОбеспеченияДокумента(Объект, ПереченьВариантов, Параметры, ИндексыСтрок)

	Перем СтатусКВыполнению, ГруппаСкладов, МенеджерРегистра, ТаблицаДляПроведения, ОтборПоИзмерениям;
	ПрименитьПараметрыДокумента(Параметры, СтатусКВыполнению, ГруппаСкладов, МенеджерРегистра, ТаблицаДляПроведения, ОтборПоИзмерениям);

	ТабЧасть = Объект[Параметры.ИмяТабличнойЧасти];
	ПутиКДанным = Параметры.ПутиКДанным;

	// Таблица выделенных строк табличной части.
	ТаблицаВыделенныеСтроки = ТабличнуюЧастьВТаблицу(ТабЧасть, Объект, ПутиКДанным, ИндексыСтрок);
	ЗаполнитьТипНоменклатурыВТаблице(ТаблицаВыделенныеСтроки);

	ОтборОформлено = ТаблицаПоОписаниюПолей(Новый Структура("Ссылка, КодСтроки",
	ОбеспечениеКлиентСервер.ОписаниеТиповЗаказыКОбеспечению(), ОбщегоНазначенияУТ.ПолучитьОписаниеТиповЧисла(15, 0)));
	Для Каждого Индекс Из ИндексыСтрок Цикл

		Строка = ТабЧасть[Индекс];
		Строка.Количество = 0;

		СтрокаОтбора = ОтборОформлено.Добавить();
		СтрокаОтбора.Ссылка = Объект.Ссылка;
		ЗаполнитьЗначенияСвойств(СтрокаОтбора, Строка);

	КонецЦикла;
	ОформитьПоНакладным = МенеджерРегистра.ТаблицаОформлено(ОтборОформлено, ОтборПоИзмерениям, Истина);

	// Таблица невыделенных строк табличной части.
	ТаблицаНевыделенныеСтроки = ТабличнуюЧастьВТаблицу(ТабЧасть, Объект, ПутиКДанным);
	ЗаполнитьТипНоменклатурыВТаблице(ТаблицаНевыделенныеСтроки);

	Для Каждого ВыделеннаяСтрока Из ТаблицаВыделенныеСтроки Цикл
		Строка = ТабЧасть[ВыделеннаяСтрока.Идентификатор];
		Строка.Количество = ВыделеннаяСтрока.Количество;
	КонецЦикла;

	ПараметрыЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление", ПереченьВариантов, Ложь);
    #Вставка
	//++ #5378 смарт: Тимофеева 19.01.26 / Автоматическое резервирование запасов. Ошибка при изменении даты прихода в грузе
	Если (ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") И Объект.Свойство("смартЗапчастиГарантийные") И Объект.смартЗапчастиГарантийные)
		ИЛИ (НЕ ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") И НЕ Объект.Метаданные().Реквизиты.Найти("смартЗапчастиГарантийные") = Неопределено И Объект.смартЗапчастиГарантийные) Тогда
		ПараметрыЗаполнения.Вставить("смартЗапчастиГарантийные", Истина);
	Иначе
		ПараметрыЗаполнения.Вставить("смартЗапчастиГарантийные", Ложь);
	КонецЕсли;
	//-- #5378 смарт: Тимофеева 19.01.26
	#КонецВставки
	
	Результат = ТаблицаЗаполнениеОбеспеченияУниверсальный(
		ТаблицаВыделенныеСтроки,
		ОформитьПоНакладным,
		ТаблицаНевыделенныеСтроки,
		Объект.Ссылка,
		ГруппаСкладов,
		ТаблицаДляПроведения,
		ПараметрыЗаполнения);

	Возврат Результат;

КонецФункции

&ИзменениеИКонтроль("РассчитатьПриращенияКоличестваВТаблице")
Процедура смарт_РассчитатьПриращенияКоличестваВТаблице(Таблица, КлючСтроки)

	МаксИндекс = Таблица.Количество() - 1;
	Индекс = МаксИндекс;
	ЕстьЗаписи = Индекс >= 0;

	Пока ЕстьЗаписи Цикл

		Строка = Таблица[Индекс];
		ЗаполнитьЗначенияСвойств(КлючСтроки, Строка);

		ИзмениласьЗапись = Ложь;

		#Вставка
		//++ #Б5378 смарт: Шляпников 20.01.2026 / Автоматическое резервирование запасов. Ошибка при изменении даты прихода в грузе
		Если Таблица.Колонки.Найти("смартКоличествоГарантийные") <> Неопределено Тогда
			смартГарантийныеНарастающийИтог = 0;
		КонецЕсли;
		//-- #Б5378 смарт: Шляпников 20.01.2026
		#КонецВставки
		
		НарастающийИтог = 0;
		// Цикл по сочетанию номенклатура\характеристика\склад.
		Пока Не ИзмениласьЗапись Цикл

			Строка = Таблица[Индекс];
			Строка.Количество = Строка.Количество - НарастающийИтог;
			НарастающийИтог = НарастающийИтог + Строка.Количество;
			
			#Вставка
			//++ #Б5378 смарт: Шляпников 20.01.2026 / Автоматическое резервирование запасов. Ошибка при изменении даты прихода в грузе
			Если Таблица.Колонки.Найти("смартКоличествоГарантийные") <> Неопределено Тогда
				
				Строка.смартКоличествоГарантийные = Строка.смартКоличествоГарантийные - смартГарантийныеНарастающийИтог;
				смартГарантийныеНарастающийИтог = смартГарантийныеНарастающийИтог + Строка.смартКоличествоГарантийные;
				
			КонецЕсли;
			//-- #Б5378 смарт: Шляпников 20.01.2026
			#КонецВставки

			// Переход к предыдущей записи.
			Индекс = Индекс - 1;
			ЕстьЗаписи = Индекс >= 0;

			ИзмениласьЗапись = Не ЕстьЗаписи Или ОбеспечениеКлиентСервер.ИзменилсяКлюч(КлючСтроки, Таблица[Индекс]);

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

//-- #4314 смарт: Тимофеева 10.09.2025

#КонецОбласти
